x1 = int(input())
y1 = int(input())

x2 = int(input())
y2 = int(input())

#Ладья ходит по горизонтали или вертикали на любое количество клеток.
if (x2 == x1) or (y2 == y1):
    print("Ладья может совершить такой ход")
else:
    print("Ладья не может совершить такой ход")
#Слон ходит по диагонали на любое количество клеток.
if abs((x2 - x1)) == abs((y2 - y1)):
    print("Слон может совершить такой ход")
else:
    print("Слон не может совершить такой ход")
#Конь ходит на две клетки по вертикали в любом направлении и на одну клетку по горизонтали, или наоборот.
if ((x1 - x2 == 1) and (y2 - y1 == 2) or (x2 - x1 == 2) and (y1 - y2 == 1) or (x2 - x1 == 1) and (y2 - y1 == 2) or (x2 - x1 == 2) and (y2 - y1 == 1) or (x1 - x2 == 2) and (y2 - y1 == 1) or (x2 - x1 == 1) and (y1 - y2 == 2) or (x1 - x2 == 2) and (y1 - y2 == 1) or (x1 - x2 == 1) and (y1 - y2 == 2)):
    print("Конь может совершить такой ход")
else:
    print("Конь не может совершить такой ход")



#((x1 - x2 == 1) and (y2 - y1 == 2) or (x2 - x1 == 2) and (y1 - y2 == 1) or (x2 - x1 == 1) and (y2 - y1 == 2) or (x2 - x1 == 2) and (y2 - y1 == 1) or (x1 - x2 == 2) and (y2 - y1 == 1) or (x2 - x1 == 1) and (y1 - y2 == 2) or (x1 - x2 == 2) and (y1 - y2 == 1) or (x1 - x2 == 1) and (y1 - y2 == 2))