numbers = {'ноль': 0, 'один': 1, 'два': 2, 'три': 3, 'четыре': 4, 'пять': 5, 'шесть': 6, 'семь': 7, 'восемь': 8, 'девять': 9, 'десять': 10}
words = {0: 'ноль', 1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять', 6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять', 10: 'десять', 11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать', 14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать', 17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать', 20: 'двадцать'}

text = input()
result = 0
words_txt = text.split()

if words_txt[1] == 'плюс':
    result = numbers[words_txt[0]] + numbers[words_txt[2]]
elif words_txt[1] == 'минус':
    result = numbers[words_txt[0]] - numbers[words_txt[2]]


if result < 0:
    print(f"минус {words[abs(result)]}")
else:
    print(f"{words[result]}")